{
	"FormatVersion": 2,
	"Namespace": "",
	"Subnamespaces": [
		{
			"Namespace": "AdventurePluginEditor",
			"Children": [
				{
					"Source":
					{
						"Text": "Adventure Editor"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "AdventurePluginEditorMenuCombo"
				},
				{
					"Source":
					{
						"Text": "Adventure Editor menu combo button"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "AdventurePluginEditorMenuCombo_ToolTip"
				},
				{
					"Source":
					{
						"Text": "Adventure Plugin"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "SettingsGeneralSectionName"
				},
				{
					"Source":
					{
						"Text": "Adventure Plugin"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "AdventurePluginAssetCategory"
				},
				{
					"Source":
					{
						"Text": "Adventure Plugin Log"
					},
					"Translation":
					{
						"Text": "Log AP"
					},
					"Key": "AdventurePluginLog"
				},
				{
					"Source":
					{
						"Text": "Base configuration for the Adventure Plugin"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "SettingsGeneralSectionDescription"
				}
			]
		},
		{
			"Namespace": "AdventurePluginEditorToolBarViewMenu",
			"Children": [
				{
					"Source":
					{
						"Text": "Adventure Plugin Tabs"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Adventure Plugin"
				},
				{
					"Source":
					{
						"Text": "Change the settings of the currently loaded project"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "ProjectSettingsMenuToolTip"
				},
				{
					"Source":
					{
						"Text": "Project Settings..."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "ProjectSettingsMenuLabel"
				},
				{
					"Source":
					{
						"Text": "other"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "other"
				}
			]
		},
		{
			"Namespace": "AP",
			"Children": [
				{
					"Source":
					{
						"Text": "Combinations should not be added to an item outside of InitCombinations method"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Combinations not initializing"
				},
				{
					"Source":
					{
						"Text": "GetItem::gameContext->ItemManager is NULL"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "ItemManagerNull"
				},
				{
					"Source":
					{
						"Text": "GotoNode: Parent graph is not a dialog graph"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "InvalidDialogGraph"
				},
				{
					"Source":
					{
						"Text": "ItemManager::GetItem - Item is NULL."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "getItemNull"
				},
				{
					"Source":
					{
						"Text": "ItemManager::GetItem - Item is abstract."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "getItemAbstract"
				},
				{
					"Source":
					{
						"Text": "One of the items being combined is null."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "NullCombinationItem"
				},
				{
					"Source":
					{
						"Text": "Quest graph node: Inventory: Invalid context passed"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Invalid Inventory Game context"
				},
				{
					"Source":
					{
						"Text": "Quest graph node: Inventory: Nil or invalid item passed"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Invalid Item"
				},
				{
					"Source":
					{
						"Text": "Quest graph node: Item could not be instantiated"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Invalid Item Instance"
				},
				{
					"Source":
					{
						"Text": "Quest graph node: Subquest: Nil or invalid Subquest passed"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Invalid Subquest"
				},
				{
					"Source":
					{
						"Text": "Quest {0}: Cannot set a flag to true, flag with name {1} not found."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Quest node not found"
				},
				{
					"Source":
					{
						"Text": "Quest {0}: Nil node or node that is not a QuestGraphNode found in a quest graph"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Nil or invalid quest node"
				},
				{
					"Source":
					{
						"Text": "Quest {0}: Quest flag set to true even though at least one of its predecessors are false. FlagName: {1}"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Parent nodes not true"
				},
				{
					"Source":
					{
						"Text": "Show dialog::gameContext is NULL"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "GameContextNull"
				},
				{
					"Source":
					{
						"Text": "Show dialog::gameContext->DialogueController is NULL"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "DialogControllerNull"
				},
				{
					"Source":
					{
						"Text": "Show dialog::graph is NULL"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "DialogGraphNull"
				},
				{
					"Source":
					{
						"Text": "Show dialog::startNode is NULL"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "startNodeNull"
				},
				{
					"Source":
					{
						"Text": "ShowInventory::gameContext->InventoryController is NULL"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "InventoryControllerNull"
				}
			]
		},
		{
			"Namespace": "AssetEditor_DialogGraph",
			"Children": [
				{
					"Source":
					{
						"Text": "DIALOG GRAPH"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "AppearanceCornerText_DialogGraph"
				}
			]
		},
		{
			"Namespace": "AssetEditor_GenericGraph",
			"Children": [
				{
					"Source":
					{
						"Text": "Generic Graph"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "AppearanceCornerText_GenericGraph"
				},
				{
					"Source":
					{
						"Text": "Generic Graph Editor"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "WorkspaceMenu_GenericGraphEditor"
				},
				{
					"Source":
					{
						"Text": "Generic Graph Editor"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "GenericGraphEditorAppLabel"
				},
				{
					"Source":
					{
						"Text": "Generic Graph Editor Setttings"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "EditorSettings_Title"
				},
				{
					"Source":
					{
						"Text": "Generic Graph Editor Setttings"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "EditorSettingsTab"
				},
				{
					"Source":
					{
						"Text": "Generic Graph Editor: Auto Arrange"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "GenericGraphEditorAutoArrange"
				},
				{
					"Source":
					{
						"Text": "Property"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Details_Title"
				},
				{
					"Source":
					{
						"Text": "Property"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "DetailsTab"
				},
				{
					"Source":
					{
						"Text": "Viewport"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "ViewportTab_Title"
				},
				{
					"Source":
					{
						"Text": "Viewport"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "GraphCanvasTab"
				},
				{
					"Source":
					{
						"Text": "{GenericGraphName}{DirtyState}"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "GenericGraphEditorToolkitName"
				}
			]
		},
		{
			"Namespace": "AssetEditor_QuestGraph",
			"Children": [
				{
					"Source":
					{
						"Text": "QUEST GRAPH"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "AppearanceCornerText_QuestGraph"
				}
			]
		},
		{
			"Namespace": "AssetEditorToolbar_GenericGraph",
			"Children": [
				{
					"Source":
					{
						"Text": "Auto Arrange"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "AutoArrange_Label"
				},
				{
					"Source":
					{
						"Text": "Auto arrange nodes, not perfect, but still handy"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "AutoArrange_ToolTip"
				},
				{
					"Source":
					{
						"Text": "Graph Settings"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "GraphSettings_Label"
				},
				{
					"Source":
					{
						"Text": "Show the Graph Settings"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "GraphSettings_ToolTip"
				}
			]
		},
		{
			"Namespace": "AssetSchema_GenericGraph",
			"Children": [
				{
					"Source":
					{
						"Text": "Add node here"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "NewGenericGraphNodeTooltip"
				},
				{
					"Source":
					{
						"Text": "Both are on the same node"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "PinErrorSameNode"
				},
				{
					"Source":
					{
						"Text": "Break Link To..."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "BreakLinkTo"
				},
				{
					"Source":
					{
						"Text": "Break a specific link..."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "BreakSpecificLinks"
				},
				{
					"Source":
					{
						"Text": "Break link to {NodeTitle}"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "BreakDesc"
				},
				{
					"Source":
					{
						"Text": "Break link to {NodeTitle} ({NumberOfNodes})"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "BreakDescMulti"
				},
				{
					"Source":
					{
						"Text": "Can't connect input node to input node"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "PinErrorInput"
				},
				{
					"Source":
					{
						"Text": "Can't connect output node to output node"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "PinErrorOutput"
				},
				{
					"Source":
					{
						"Text": "Can't create a graph cycle"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "PinErrorCycle"
				},
				{
					"Source":
					{
						"Text": "Connect nodes with edge"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "PinConnect"
				},
				{
					"Source":
					{
						"Text": "Generic Graph Editor: New Edge"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "GenericGraphEditorNewEdge"
				},
				{
					"Source":
					{
						"Text": "Generic Graph Editor: New Node"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "GenericGraphEditorNewNode"
				},
				{
					"Source":
					{
						"Text": "Generic Graph Node"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "GenericGraphNodeAction"
				},
				{
					"Source":
					{
						"Text": "Node Actions"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "NodeActionsMenuHeader"
				},
				{
					"Source":
					{
						"Text": "Not a valid UGenericGraphEdNode"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "PinError"
				},
				{
					"Source":
					{
						"Text": "Pin Actions"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "PinActionsMenuHeader"
				},
				{
					"Source":
					{
						"Text": "{NodeTitle} ({PinName})"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "BreakDescPin"
				}
			]
		},
		{
			"Namespace": "AssetTypeActions_AdventureCharacter",
			"Children": [
				{
					"Source":
					{
						"Text": "Adventure Character"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "AssetName"
				},
				{
					"Source":
					{
						"Text": "Adventure Character"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "AssetDescription"
				}
			]
		},
		{
			"Namespace": "AssetTypeActions_DialogGraph",
			"Children": [
				{
					"Source":
					{
						"Text": "Dialog Graph"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "FDialogGraphAssetTypeActionsName"
				}
			]
		},
		{
			"Namespace": "AssetTypeActions_GenericGraph",
			"Children": [
				{
					"Source":
					{
						"Text": "Generic Graph"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "FGenericGraphAssetTypeActionsName"
				}
			]
		},
		{
			"Namespace": "AssetTypeActions_InventoryItem",
			"Children": [
				{
					"Source":
					{
						"Text": "Inventory Item"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "AssetName"
				},
				{
					"Source":
					{
						"Text": "Inventory Item"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "AssetDescription"
				}
			]
		},
		{
			"Namespace": "AssetTypeActions_QuestGraph",
			"Children": [
				{
					"Source":
					{
						"Text": "Quest Graph"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "FQuestGraphAssetTypeActionsName"
				}
			]
		},
		{
			"Namespace": "Contexts",
			"Children": [
				{
					"Source":
					{
						"Text": "AdventurePluginDialogEditor Plugin"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "AdventurePluginDialogEditor"
				},
				{
					"Source":
					{
						"Text": "AdventurePluginEditor Plugin"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "AdventurePluginEditor"
				},
				{
					"Source":
					{
						"Text": "AdventurePluginInventoryEditor Plugin"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "AdventurePluginInventoryEditor"
				},
				{
					"Source":
					{
						"Text": "AdventurePluginStoryEngineEditor Plugin"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "AdventurePluginStoryEngineEditor"
				},
				{
					"Source":
					{
						"Text": "Generic Graph Editor"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "GenericGraphEditor"
				}
			]
		},
		{
			"Namespace": "DialogGraphNode",
			"Children": [
				{
					"Source":
					{
						"Text": "Dialog Graph Node"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "NodeDesc"
				}
			]
		},
		{
			"Namespace": "DialogGraphNode_NPC",
			"Children": [
				{
					"Source":
					{
						"Text": "<Insert something clever>"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "DefaultDialog"
				}
			]
		},
		{
			"Namespace": "DialogGraphNode_Options",
			"Children": [
				{
					"Source":
					{
						"Text": "Dialog Options"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "OptionsName"
				}
			]
		},
		{
			"Namespace": "DialogGraphNode_Player",
			"Children": [
				{
					"Source":
					{
						"Text": "<Insert something clever>"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "DefaultDialog"
				}
			]
		},
		{
			"Namespace": "DialogGraphNode_PlayerLineOption",
			"Children": [
				{
					"Source":
					{
						"Text": "<Insert something clever>"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "DefaultDialog"
				}
			]
		},
		{
			"Namespace": "Editor_GenericGraph",
			"Children": [
				{
					"Source":
					{
						"Text": "GenericGraph"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "GenericGraphAssetCategory"
				}
			]
		},
		{
			"Namespace": "EdNode_GenericGraph",
			"Children": [
				{
					"Source":
					{
						"Text": "Generic Graph Editor: Rename Node"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "GenericGraphEditorRenameNode"
				}
			]
		},
		{
			"Namespace": "FAdventurePluginDialogEditor",
			"Children": [
				{
					"Source":
					{
						"Text": "DIALOG EDITOR"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "AdventurePlugin_DialogEditor"
				},
				{
					"Source":
					{
						"Text": "Dialog "
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "WorldCentricTabPrefix"
				},
				{
					"Source":
					{
						"Text": "Dialog Editor"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "WorkspaceMenu_DialogEditor"
				},
				{
					"Source":
					{
						"Text": "Dialog Editor"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "AppLabel"
				},
				{
					"Source":
					{
						"Text": "Graph"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "GraphCanvasTitle"
				},
				{
					"Source":
					{
						"Text": "Graph"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "GraphCanvasTab"
				}
			]
		},
		{
			"Namespace": "FAdventurePluginDialogEditorModule",
			"Children": [
				{
					"Source":
					{
						"Text": "Dialog Editor"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "AdventurePlugin_DialogEditorName"
				}
			]
		},
		{
			"Namespace": "FAdventurePluginInventoryEditorModule",
			"Children": [
				{
					"Source":
					{
						"Text": "Add code to {0} in {1} to override this window's contents"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "WindowWidgetText"
				},
				{
					"Source":
					{
						"Text": "AdventurePluginInventoryEditor"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "FAdventurePluginInventoryEditorTabTitle"
				}
			]
		},
		{
			"Namespace": "GenericGraphNode",
			"Children": [
				{
					"Source":
					{
						"Text": "Generic Graph Node"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "NodeDesc"
				}
			]
		},
		{
			"Namespace": "UICommands",
			"Subnamespaces": [
				{
					"Namespace": "EditorCommands_GenericGraph",
					"Children": [
						{
							"Source":
							{
								"Text": "Auto Arrange"
							},
							"Translation":
							{
								"Text": ""
							},
							"Key": "AutoArrange_ToolTip"
						},
						{
							"Source":
							{
								"Text": "Auto Arrange"
							},
							"Translation":
							{
								"Text": ""
							},
							"Key": "AutoArrange"
						},
						{
							"Source":
							{
								"Text": "Graph Settings"
							},
							"Translation":
							{
								"Text": ""
							},
							"Key": "GraphSettings_ToolTip"
						},
						{
							"Source":
							{
								"Text": "Graph Settings"
							},
							"Translation":
							{
								"Text": ""
							},
							"Key": "GraphSettings"
						}
					]
				},
				{
					"Namespace": "FAdventurePluginDialogEditorModule",
					"Children": [
						{
							"Source":
							{
								"Text": "AdventurePluginDialogEditor"
							},
							"Translation":
							{
								"Text": ""
							},
							"Key": "OpenPluginWindow"
						},
						{
							"Source":
							{
								"Text": "Bring up AdventurePluginDialogEditor window"
							},
							"Translation":
							{
								"Text": ""
							},
							"Key": "OpenPluginWindow_ToolTip"
						}
					]
				},
				{
					"Namespace": "FAdventurePluginEditorModule",
					"Children": [
						{
							"Source":
							{
								"Text": "AdventurePluginEditor"
							},
							"Translation":
							{
								"Text": ""
							},
							"Key": "OpenPluginWindow"
						},
						{
							"Source":
							{
								"Text": "Bring up AdventurePluginEditor window"
							},
							"Translation":
							{
								"Text": ""
							},
							"Key": "OpenPluginWindow_ToolTip"
						}
					]
				},
				{
					"Namespace": "FAdventurePluginInventoryEditorModule",
					"Children": [
						{
							"Source":
							{
								"Text": "AdventurePluginInventoryEditor"
							},
							"Translation":
							{
								"Text": ""
							},
							"Key": "OpenPluginWindow"
						},
						{
							"Source":
							{
								"Text": "Bring up AdventurePluginInventoryEditor window"
							},
							"Translation":
							{
								"Text": ""
							},
							"Key": "OpenPluginWindow_ToolTip"
						}
					]
				},
				{
					"Namespace": "FAdventurePluginStoryEngineEditorModule",
					"Children": [
						{
							"Source":
							{
								"Text": "AdventurePluginStoryEngineEditor"
							},
							"Translation":
							{
								"Text": ""
							},
							"Key": "OpenPluginWindow"
						},
						{
							"Source":
							{
								"Text": "Bring up AdventurePluginStoryEngineEditor window"
							},
							"Translation":
							{
								"Text": ""
							},
							"Key": "OpenPluginWindow_ToolTip"
						}
					]
				}
			]
		},
		{
			"Namespace": "UInventoryItemFactory",
			"Children": [
				{
					"Source":
					{
						"Text": "Cannot create inventory item blueprint."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "CannotCreateInventoryItem"
				}
			]
		}
	]
}